Repository: jayvenn/LearnCSinAR
Catalog: Learn CS in AR/Localization/*.lproj/Localizable.strings
Languages: es, zh_hans, zh_hant

source: Tracker
es: Rastreador

source: Cancel
es: Cancelar

source: Lesson info
es: Información de la lección

source: Operation info
es: Información de operación

source: %@ lesson
es: %@ Lección

source: cube
es: cubo
zh_hans: 立方体
zh_hant: 立方體

source: cubes
es: cubitos
zh_hans: 立方体
zh_hant: 立方體

source: Learn CS in AR
es: Aprende CS en AR
zh_hans: 在AR学习CS
zh_hant: 在AR學習CS

source: Made for CS Students
es: Hecho para estudiantes de CS
zh_hans: 为CS学生而制作
zh_hant: 為CS學生而製作

source: Computer Science for Everyone
es: Ciencias De La Computación Para Todos

source: Purpose
es: Propósito
zh_hans: 目的
zh_hant: 目的

source: Contribute
es: Contribuir

source: Begin
es: Comienza
zh_hans: 开始
zh_hant: 開始

source: Back
es: Regresa
zh_hans: 回
zh_hant: 回

source: Select a Course
es: Seleccione un curso
zh_hans: 选择课程
zh_hant: 選擇課程

source: Move around to find a surface
es: Muévete para encontrar una superficie.
zh_hans: 四处走找一个表面
zh_hant: 四處走找一個表面

source: Begin Lesson
es: Comienza la Lección
zh_hans: 开始课
zh_hant: 開始課

source: Ordering
es: Ordenando
zh_hans: 排序
zh_hant: 排序

source: Operation
es: Operación
zh_hans: 操作
zh_hant: 操作

source: Data Structures
es: Estructuras de Datos
zh_hans: 数据结构
zh_hant: 數據結構

source: A stack data structure uses the last-in-first-out (LIFO) ordering.
es: Una estructura de datos stack utiliza el orden de último en entrar primero en salir.
zh_hans: Stack数据结构使用后进先出排序。
zh_hant: STACK數據結構使用後進先出排序。

source: Go in first, get out last. Go in last, get out first.
es: Entra primero, vete el último. Entra por último, vete primero.
zh_hans: 先进去，后出去。最进去，先出去。
zh_hant: 先進去，後出去。最進去，先出去。

source: A queue data structure uses the first-in-first-out (FIFO) ordering.
es: Una estructura de datos queue utiliza el orden de primer en entrar primero en salir.
zh_hans: QUEUE数据结构使用先进先出顺序。
zh_hant: QUEUE數據結構使用先進先出順序。

source: The %@ that moves into the container first is the %@ that can move out of the container first. Conversely, the %@ that moves into the container last is the %@ that can move out of the container last.
es: El OBJETO que se mueve primero al contenedor es el OBJETO que puede salir primero del contenedor. Por el contrario, el OBJETO que se mueve al contenedor por última vez es el OBJETO que puede salir del contenedor al final.

source: Go in first, get out first. Go in last, get out last.
es: Entra primero, vete primero. Entra el último, vete el último
zh_hans: 先进去，先出去 后进去，后出去。
zh_hant: 先進去，先出去 後進去，後出去。

source: A %@ data structure uses an ordering sequence where each %@ references the next %@ if the next %@ exists.
es: Una estructura de datos %@ utiliza una secuencia de ordenamiento donde cada %@ hace referencia al siguiente %@ si existe el siguiente %@

source: The first %@ has a reference to the second %@. The second %@ has a reference to the third %@. The third %@’s next %@ reference is nothing or nil.
es: El primer OBJETO tiene una referencia al segundo OBJETO. El segundo OBJETO tiene una referencia al tercer OBJETO. La siguiente referencia OBJETO del tercer OBJETO es nada.

source: First references second. Second references third. This pattern continues until you reach the last %@.
es: El primer hace referencia al segundo. El segundo hace referencia al tercer. Este patrón continúa hasta llegar al último OBJETO.

source: A %@ data structure uses an ordering sequence where each %@ references the next %@ if the next %@ exists. In addition, the next %@ that is being referenced will also reference back to the %@ that references it.
es: Una estructura de datos %@ utiliza una secuencia de ordenamiento donde cada %@ hace referencia al siguiente %@ si existe el siguiente %@. Además, el próximo %@ al que se hace referencia también hará referencia al %@ que lo referencia.

source: The first %@ references the second %@. The second %@ references the first %@. The same referencing procedure occurs between the second and third %@.
es: El primer OBJETO hace referencia al segundo OBJETO. El segundo OBJETO hace referencia al primer OBJETO. El mismo procedimiento de referencia se produce entre el segundo y el tercer OBJETO

source: First references second. Second references first. Second references third. Third references second. This pattern continues until you reach the last %@.
es: El primer hace referencia al segundo. El segundo hace referencia al primer. El segundo hace referencia al tercer. El tercer hace referencia al segundo. Este patrón continúa hasta llegar al último OBJETO.

source: A %@ data structure uses an ordering sequence where each %@ can have a maximum of two children.
es: Una estructura de datos %@ utiliza una secuencia de ordenamiento donde cada %@ puede tener un máximo de dos hijos.

source: When a child %@ is added onto a root %@, the child %@ will reside either on the left or right of the root %@. The child %@ position will depend on the %@'s size in comparison to the other child %@. The smaller %@ will reside on the left. The bigger %@ will reside on the right. If there the added %@ is the only child, it will be reside on the left. When a %@ is added, a reference is created.
es: Cuando se agrega un OBJETO infantil a un OBJETO raíz, el OBJETO hijo residirá ya sea a la izquierda o a la derecha del OBJETO raíz. La posición del OBJETO infantil dependerá del tamaño del OBJETO en comparación con el otro OBJETO infantil. resida a la izquierda. El OBJETO más grande residirá a la derecha. Si existe el OBJETO agregado es el único hijo, residirá a la izquierda. Cuando se agrega un OBJETO, se crea una referencia.

source: A %@ can have a maximum of two children. All children are bound to have a maximum of two children. Children in the same hierarchy are called siblings. The %@ which a %@ references from is called a parent node.
es: Un OBJETO puede tener un máximo de dos hijos. Todos los niños están obligados a tener un máximo de dos hijos. Los niños en la misma jerarquía se llaman hermanos. El OBJETO al que hace referencia un OBJETO se llama nodo padre.

source: If the OBJECT that moves into the container first wants to move out of the container, it will have to wait until every other OBJECT have moved out of the container before it can do the same. Conversely, the OBJECT that moves into the container last can move out of the container first.
zh_hans: 如果移动到容器中的OBJECT首先想要移出容器，则它必须等到所有其他OBJECT都移出容器才能执行相同操作。 相反，最后移入容器的OBJECT可以首先移出容器。
zh_hant: 如果移动到容器中的OBJECT首先想要移出容器，则它必须等到所有其他OBJECT都移出容器才能执行相同操作。 相反，最后移入容器的OBJECT可以首先移出容器。

source: The OBJECT that moves into the container first is the OBJECT that can move out of the container first. Conversely, the OBJECT that moves into the container last is the OBJECT that can move out of the container last.
zh_hans: 首先移动到容器中的OBJECT是可以首先移出容器的OBJECT。 相反，最后移入容器的OBJECT是可以最后移出容器的OBJECT。
zh_hant: 首先移动到容器中的OBJECT是可以首先移出容器的OBJECT。 相反，最后移入容器的OBJECT是可以最后移出容器的OBJECT。

source: A OBJECT data structure uses an ordering sequence where each OBJECT references the next OBJECT if the next OBJECT exists.
zh_hans: OBJECT数据结构使用排序序列，其中如果存在下一个OBJECT，则每个OBJECT引用下一个OBJECT。
zh_hant: OBJECT數據結構使用排序順序，如果下一個OBJECT存在，則每個OBJECT引用下一個OBJECT。

source: The first OBJECT has a reference to the second OBJECT. The second OBJECT has a reference to the third OBJECT. The third OBJECT’s next OBJECT reference is nothing or nil.
zh_hans: 第一个OBJECT引用了第二个OBJECT。 第二个OBJECT引用了第三个OBJECT。 第三个OBJECT的下一个OBJECT参考是没有。
zh_hant: 第一个OBJECT引用了第二个OBJECT。 第二个OBJECT引用了第三个OBJECT。 第三个OBJECT的下一个OBJECT参考是没有。

source: First references second. Second references third. This pattern continues until you reach the last OBJECT.
zh_hans: 第一个引用第二个。 第二个引用第三个。 这种模式一直持续到最后一个OBJECT。
zh_hant: 第一个引用第二个。 第二个引用第三个。 这种模式一直持续到最后一个OBJECT。

source: A OBJECT data structure uses an ordering sequence where each OBJECT references the next OBJECT if the next OBJECT exists. In addition, the next OBJECT that is being referenced will also reference back to the OBJECT that references it.
zh_hans: OBJECT数据结构使用排序序列，其中如果存在下一个OBJECT，则每个OBJECT引用下一个OBJECT。 此外，正在引用的下一个OBJECT也将引用回引用它的OBJECT。
zh_hant: %@數據結構使用排序序列，其中如果存在下一個%@，則每個%@引用下一個%@。此外，正在引用的下一個OBJECT也將引用回引用它的%@。

source: The first OBJECT references the second OBJECT. The second OBJECT references the first OBJECT. The same referencing procedure occurs between the second and third OBJECT.
zh_hans: 第一个OBJECT引用第二个OBJECT。 第二个OBJECT引用第一个OBJECT。 在第二个和第三个OBJECT之间发生相同的引用过程。
zh_hant: 第一個OBJECT引用第二個OBJECT。 第二個OBJECT引用第一個OBJECT。 在第二個和第三個OBJECT之間發生相同的引用過程。

source: First references second. Second references first. Second references third. Third references second. This pattern continues until you reach the last OBJECT.
zh_hans: 第一个引用第二个。第二个引用第一个。第二个引用第三个。第三个引用第二个。这种模式一直持续到最后一个OBJECT。
zh_hant: 第一個引用第二個。 第二個引用第一個。 第二個引用第三個。 第三個引用第二個。 這種模式一直持續到最後一個OBJECT。

source: A OBJECT data structure uses an ordering sequence where each OBJECT can have a maximum of two children.
zh_hans: OBJECT数据结构使用一个排序顺序，其中每个OBJECT最多可以有两个子节点。
zh_hant: OBJECT數據結構使用一個排序序列，其中每個OBJECT最多可以有兩個子節點。

source: When a child OBJECT is added onto a root OBJECT, the child OBJECT will reside either on the left or right of the root OBJECT. The child OBJECT position will depend on the OBJECT's size in comparison to the other child OBJECT. The smaller OBJECT will reside on the left. The bigger OBJECT will reside on the right. If there the added OBJECT is the only child, it will be reside on the left. When a OBJECT is added, a reference is created.
zh_hans: 将子OBJECT添加到根OBJECT时，子OBJECT将位于根OBJECT的左侧或右侧。子OBJECT位置将取决于OBJECT的大小与其他子OBJECT的比较。较小的OBJECT将 位于左侧。较大的OBJECT将位于右侧。如果添加的OBJECT是唯一的子级，则它将驻留在左侧。当添加OBJECT时，将创建一个引用。
zh_hant: 將子OBJECT添加到根OBJECT時，子OBJECT將位於根OBJECT的左側或右側。子OBJECT位置將取決於OBJECT的大小與其他子OBJECT的比較。較小的OBJECT將 位於左側。較大的OBJECT將位於右側。如果添加的OBJECT是唯一的子級，則它將駐留在左側。當添加OBJECT時，將創建一個引用。

source: A OBJECT can have a maximum of two children. All children are bound to have a maximum of two children. Children in the same hierarchy are called siblings. The OBJECT which a OBJECT references from is called a parent node.
zh_hans: 一个OBJECT最多可以有两个孩子。 所有儿童最多只能有两个孩子。 同一层次结构中的孩子称为兄弟姐妹。 OBJECT引用的OBJECT称为父节点。
zh_hant: 一个OBJECT最多可以有两个孩子。 所有儿童最多只能有两个孩子。 同一层次结构中的孩子称为兄弟姐妹。 OBJECT引用的OBJECT称为父节点。
